---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotConnectDifferentDesignOptsObjects
source: html/32976c85-58dd-f9ee-96b7-e3a749cf197b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotConnectDifferentDesignOptsObjects Property

Cannot add or assign [Element] to circuit. Electrical objects belonging to different design options cannot be connected.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotConnectDifferentDesignOptsObjects { get; }
```